import './index.css'
const text1 = () => (
    <p className='text-align-new2'>
    Το Υπουργείο Εργασίας και Κοινωνικών Υποθέσεων είναι υπουργείο της Ελληνικής Δημοκρατίας, το οποίο συστάθηκε από τη κυβέρνηση Κυριάκου Μητσοτάκη στις 8 Ιουλίου 2019.
    Το υπουργείο αυτό διαδέχθηκε το Υπουργείο Εργασίας, Κοινωνικής Ασφάλισης και Κοινωνικής Αλληλεγγύης.
    Υπουργός από τον Ιούλιο του 2020 ήταν ο Γιάννης Βρούτσης, μέχρι την αντικατάσταση του τον Ιανουάριο του 2021 από τον Κωστή Χατζηδάκη.
    </p>
  );
  
  const text2 = () => (
    <p className='text-align-new2'>
        <ol>
        <li> 
            Το ανώτατο όριο ασφαλιστέων αποδοχών για τον υπολογισμό της μηνιαίας ασφαλιστικής εισφοράς των μισθωτών και των εργοδοτών, συνίσταται στο δεκαπλάσιο 
            του ποσού που αντιστοιχεί στον εκάστοτε προβλεπόμενο κατώτατο βασικό μισθό άγαμου μισθωτού, το οποίο ποσό από 1/2/2019 ανέρχεται στα <b>6.500,00 €</b>.
            Το ως άνω ανώτατο όριο ασφαλιστέων αποδοχών εφαρμόζεται και επί πολλαπλής μισθωτής απασχόλησης ή έμμισθης εντολής όσον αφορά στην εισφορά του ασφαλισμένου.
        </li>
        <li>
            Η ελάχιστη μηνιαία βάση υπολογισμού των εισφορών των μισθωτών με πλήρη απασχόληση καθορίζεται με βάση το ποσό που αντιστοιχεί στον κατώτατο βασικό μισθό άγαμου μισθωτού, 
            το οποίο ποσό από 1/2/2019 ορίζεται στα <b>650,00 €</b>, χωρίς ηλικιακή διάκριση. 
            Επισημαίνεται, ότι για τους εργατοτεχνίτες, το κατώτατο ημερομίσθιο ορίζεται από 1/2/2019 στα <b>είκοσι εννέα ευρώ και τέσσερα λεπτά (29,04€)</b>. 
        </li>
        </ol>
    </p>
  );
  const text3 = () => (
    <p className='text-align-new2'>
        Σύμφωνα με τις διατάξεις του Ν. 4387/2016, όπως έχουν τροποποιηθεί και ισχύουν από 13.5.2016 και μετά, το ποσό της σύνταξης λόγω γήρατος αποτελεί άθροισμα 
        της εθνικής και της ανταποδοτικής σύνταξης (εγκ. 24/2017)  Η εθνική σύνταξη χρηματοδοτείται από τον κρατικό προϋπολογισμό, ενώ η ανταποδοτική σύνταξη αντιστοιχεί 
        στην καταβολή ασφαλιστικών εισφορών και υπολογίζεται βάσει των συντάξιμων αποδοχών, του χρόνου ασφάλισης και του ποσοστού αναπλήρωσης.
    </p>
  );
  
  export {text1, text2, text3};
  