import { Header } from "semantic-ui-react";

const text1 = () => (
    <p style={{'text-align': 'justify' , 'line-height': '1.8'}}>
                (Άρθρο 32 Ν.1568/1985, άρθρο 49 Ν.3850/2010) Οι εργαζόμενοι έχουν υποχρέωση να εφαρμόζουν τις συνθήκες υγιεινής και ασφάλειας και να φροντίζουν 
                ανάλογα με τις δυνατότητες τους για την ασφάλεια και την υγεία των ίδιων και των άλλων ατόμων που επηρεάζονται από τις ενέργειες και παραλείψεις τους 
                κατά την εργασία.
                <br/>
                Ειδικότερα οι εργαζόμενοι οφείλουν:
                <ol>
                  <li>
                    Να χρησιμοποιούν σωστά τις μηχανές, τις συσκευές, τα εργαλεία, τις επικίνδυνες ουσίες, τα μεταφορικά και άλλα μέσα.
                  </li>
                  <li>
                    Να χρησιμοποιούν σωστά τον ατομικό προστατευτικό εξοπλισμό τους.
                  </li>
                  <li>
                    Να μην θέτουν εκτός λειτουργίας, αλλάζουν ή μετατοπίζουν αυθαίρετα τους μηχανισμούς ασφάλειας των μηχανών, εργαλείων, συσκευών, εγκαταστάσεων.
                  </li>
                  <li>
                    Να αναφέρουν αμέσως στον εργοδότη όλες τις καταστάσεις που παρουσιάζουν άμεσο και σοβαρό κίνδυνο για την ασφάλεια και την υγεία τους.
                  </li>
                  <li>
                    Να διευκολύνουν τον εργοδότη, ώστε να καταστεί δυνατή η εκπλήρωση όλων των καθηκόντων ή απαιτήσεων, που επιβάλλονται από την αρμόδια επιθεώρηση εργασίας στον εργοδότη για την προστασία της ασφάλειας και της υγείας των εργαζομένων.
                  </li>
                  <li>
                    Να διευκολύνουν τον εργοδότη, ώστε να μπορεί να εγγυηθεί ότι το περιβάλλον και οι συνθήκες εργασίας είναι ασφαλείς και χωρίς κινδύνους για την ασφάλεια και την υγεία εντός του πεδίου δραστηριότητάς τους.
                  </li>
                </ol>
    </p>
  );
  
  const text2 = () => (
    <p style={{'text-align': 'justify' , 'line-height': '1.8'}}>
    <Header as='h4'>Προϋποθέσεις</Header>
    1. Ηλικία από 20 μέχρι 66 ετών. <br/>

Ως ημερομηνία αφετηρίας για τη συμπλήρωση του 20ου και 66ου έτους, λογίζεται η ημερομηνία γέννησης του δικαιούχου. Κρίσιμος χρόνος συνδρομής της προϋπόθεσης των ορίων ηλικίας είναι ο χρόνος υποβολής της αίτησης.
<br/><br/>
2. Εξάντληση 12μηνης τακτικής επιδότησης ανεργίας.<br/>

Δικαιούχοι είναι και όσοι έχουν εξαντλήσει 12μηνη επιδότηση ακόμη και αν την έλαβαν τμηματικά (δηλ. με αναστολές και συνεχίσεις), και υποβάλλουν την αίτηση εντός αποσβεστικής προθεσμίας δυο (2) μηνών, από τη λήξη της 12μηνης τακτικής επιδότησης.

Οι τακτικά επιδοτούμενοι λόγω συνέχισης με βάση το άρθρο 20 του ν.δ. 2961/54, που κατά τη λήξη του υπολοίπου της 12μηνης επιδότησης δεν έχουν συμπληρώσει χρόνο παραμονής αδιαλείπτως επί 12μηνο στα μητρώα ανέργων του ΟΑΕΔ, δύνανται να υποβάλλουν τη σχετική με το επίδομα μακροχρονίως ανέργων αίτηση, μέσα σε αποσβεστική προθεσμία δύο (2) μηνών από τη συμπλήρωση της αδιάλειπτης 12μηνης παραμονής.

ΠΡΟΣΟΧΗ: δεν είναι δικαιούχοι οι άνεργοι των οποίων η εγκριτική απόφαση χορήγησης τακτικής επιδότησης ανεργίας είναι μικρότερη των δώδεκα μηνών .
<br/><br/>
3. Να έχουν συμπληρώσει κατά την ημερομηνία υποβολής της σχετικής αίτησης, χρόνο ανεργίας αδιαλείπτως επί δωδεκάμηνο, παραμένουν εγγεγραμμένοι στα μητρώα ανέργων του ΟΑΕΔ.<br/><br/>

4. Το ετήσιο οικογενειακό εισόδημα να μην υπερβαίνει τα 10.000 ΕΥΡΩ.<br/>

Το συγκεκριμένο εισόδημα προσαυξάνεται κατά 586,08 ΕΥΡΩ για κάθε ανήλικο τέκνο.

Ανήλικο τέκνο θεωρείται αυτό που δεν έχει συμπληρώσει το 18ο έτος της ηλικίας του.

Έτσι π.χ. για το δικαιούχο που έχει 2 ανήλικα τέκνα, το ετήσιο οικογενειακό του εισόδημα δεν πρέπει να υπερβαίνει τα 11.172,16 (10.000 + 586,08 + 586,08 = 11.172,16) ΕΥΡΩ

<br/><br/><b>Σημείωση :</b> Ως ετήσιο οικογενειακό εισόδημα θεωρείται το συνολικό ετήσιο φορολογούμενο, πραγματικό, απαλλασσόμενο ή φορολογούμενο με ειδικό τρόπο, εισόδημα από κάθε πηγή – με εξαίρεση τις αποζημιώσεις απόλυσης – του προ-προηγούμενου από την άσκηση του δικαιώματος φορολογικού έτους του ανέργου, της συζύγου και των ανήλικων τέκνων του. (Παράδειγμα: Για τις αιτήσεις που υποβάλλονται κατά το έτος 2018, οι δικαιούχοι θα προσκομίζουν Εκκαθαριστικό Σημείωμα έτους 2016).

Δεν προσμετράται στο ετήσιο οικογενειακό εισόδημα: το επίδομα ανεργίας, ασθενείας, μητρότητας, καθώς και το επίδομα μακροχρονίως ανέργου (για τυχόν χορήγηση του κατά το επόμενο ημερολογιακό έτος) .

Για ενήλικες άγαμους δικαιούχους ως οικογενειακό εισόδημα θεωρείται το ατομικό.
    </p>
  );
  
  const text3 = () => (
      <p style={{'text-align': 'justify' , 'line-height': '1.8'}}>
      <p style={{'text-align': 'justify' , 'line-height': '1.8'}}>
        Η Ευρωπαϊκή Στρατηγική για την Απασχόληση (ΕΣΑ) χρονολογείται από το 1997, όταν τα κράτη μέλη της ΕΕ θέλησαν να θεσπίσουν ένα σύνολο κοινών στόχων όσον αφορά την πολιτική απασχόλησης. Βασικός σκοπός της είναι η δημιουργία περισσότερων και καλύτερων θέσεων εργασίας σε όλη την Ένωση.
        Σήμερα αποτελεί μέρος της αναπτυξιακής στρατηγικής "Ευρώπη 2020" και εφαρμόζεται μέσω του Ευρωπαϊκού Εξαμήνου, μιας ετήσιας διαδικασίας που συμβάλλει στον καλύτερο συντονισμό των πολιτικών ανάμεσα στα κράτη μέλη και τα θεσμικά όργανα της ΕΕ.
        Συγκεκριμένα, η υλοποίηση της ΕΣΑ - η οποία υποστηρίζεται από την Επιτροπή απασχόλησης - επιτυγχάνεται μέσα από τα τέσσερα στάδια του Ευρωπαϊκού Εξαμήνου:
      </p>
      <p style={{'text-align': 'justify' , 'line-height': '1.8'}}>
        <ul>
            <li>
            Οι κατευθυντήριες γραμμές για την απασχόληση αποτελούν κοινές προτεραιότητες και στόχους για τις πολιτικές απασχόλησης που προτείνει η Ευρωπαϊκή Επιτροπή, συμφωνούνται από τα κράτη μέλη και εγκρίνονται από το Συμβούλιο της ΕΕ.
            </li>
            <li>
            Η κοινή έκθεση για την απασχόληση (ΚΕΑ) βασίζεται: α) στην εκτίμηση της κατάστασης στον τομέα της απασχόλησης στην Ευρώπη, β) στην υλοποίηση των κατευθυντήριων γραμμών για την απασχόληση και γ) στην αξιολόγηση του πίνακα αποτελεσμάτων των βασικών δεικτών απασχόλησης και των κοινωνικών δεικτών. Η έκθεση δημοσιεύεται από την Ευρωπαϊκή Επιτροπή και εγκρίνεται από το Συμβούλιο της ΕΕ.
            </li>
            <li>
            Τα Εθνικά Προγράμματα Μεταρρυθμίσεων (ΕΠΜ) υποβάλλονται από τα κράτη μέλη και εξετάζονται από την Ευρωπαϊκή Επιτροπή με κριτήριο κατά πόσο συνάδουν με τη στρατηγική "Ευρώπη 2020". (Βάση δεδομένων: Εθνικά Προγράμματα Μεταρρυθμίσεων πριν από το 2011)
            </li>
            <li>
            Με βάση την αξιολόγηση των ΕΠΜ, η Επιτροπή δημοσιεύει μια σειρά εκθέσεων ανά χώρα που αναλύουν την οικονομική πολιτική κάθε κράτους μέλους και διατυπώνει συστάσεις ανά χώρα.
            </li>
        </ul>
      </p>
      </p>
  );
  
  const text4 = () => (
    <p style={{'text-align': 'justify' , 'line-height': '1.8'}}>
      <p style={{'text-align': 'justify' , 'line-height': '1.8'}}>
        Κάθε εργαζόμενος στην ΕΕ έχει ορισμένα βασικά δικαιώματα στους εξής τομείς:
      </p>
      <p style={{'text-align': 'justify' , 'line-height': '1.8'}}>
        <ul aria-label="Οι οικονομικές κινήσεις αυτές αφορούν εισφορές που έχουν :">
          <li>υγεία και ασφάλεια στον χώρο εργασίας</li>
          <li>ισότητα ευκαιριών για άνδρες και γυναίκες</li>
          <li>προστασία κατά των διακρίσεων λόγω φύλου, φυλετικής καταγωγής, θρησκείας, ηλικίας, αναπηρίας και σεξουαλικού προσανατολισμού,</li>
          <li>εργατικό δίκαιο: μερική απασχόληση, συμβάσεις ορισμένου χρόνου, χρόνος εργασίας, απασχόληση των νέων, ενημέρωση και διαβούλευση με τους εργαζομένους.</li>
        </ul>
      </p>
      <p style={{'text-align': 'justify' , 'line-height': '1.8'}}>
        Κάθε χώρα της ΕΕ πρέπει να μεριμνά ώστε η εθνική της νομοθεσία να προστατεύει τα δικαιώματα αυτά, τα οποία κατοχυρώνονται με τη νομοθεσία της ΕΕ περί απασχόλησης (Οδηγίες).
        Εάν θεωρείτε ότι τα δικαιώματά σας δεν γίνονται σεβαστά, πρέπει κατ' αρχάς να προσφύγετε στην επιθεώρηση εργασίας, στο εργατικό δικαστήριο, κ.λπ. της χώρας σας.
      </p>
    </p>
  );
  
  export {text1, text2, text3, text4};
  