import './index.css'
const text1 = () => (
    <p className='text-align-new'>
        Οι Υπηρεσίες Κοινωνικών Ασφαλίσεων είναι αρμόδιες για την εφαρμογή της κυβερνητικής πολιτικής στον τομέα της κοινωνικής ασφάλισης.
        Στο πλαίσιο της πολιτικής αυτής, οι Υπηρεσίες Κοινωνικών Ασφαλίσεων είναι υπεύθυνες για την εφαρμογή των νομοθεσιών:
      <ul>
        <li>Κοινωνικών Ασφαλίσεων,</li>
        <li>Ετήσιων Αδειών μετ’ Απολαβών,</li>
        <li>Τερματισμού Απασχολήσεως,</li>
        <li>Ταμείων Προνοίας,</li>
        <li>Κοινωνικής Σύνταξης,</li>
        <li>Αποζημίωσης Θυμάτων Βίαιων Εγκλημάτων</li>
        <li>Προστασίας των Δικαιωμάτων των Εργοδοτουμένων σε Περίπτωση Αφερεγγυότητας του Εργοδότη, και</li>
        <li> Ίσης Μεταχείρισης Ανδρών και Γυναικών στα Επαγγελματικά Σχέδια Κοινωνικής Ασφάλισης.</li>
      </ul>
      Όσοι οφειλέτες δεν έχουν αποκτήσει κωδικούς πρόσβασης για τις ηλεκτρονικές υπηρεσίες θα πρέπει,
      πριν την υποβολή αίτησης ρύθμισης, να πιστοποιηθούν μέσω της υπηρεσίας Πιστοποίηση οφειλετών.
    </p>
  );
  
  const text2 = () => (
    <p className='text-align-new'>
        Οι Υπηρεσίες Κοινωνικής Ευημερίας είναι αρμόδιες για την προώθηση και εφαρμογή της κυβερνητικής πολιτικής στον τομέα της κοινωνικής ευημερίας.
        Οι βασικότερες επιδιώξεις των Υπηρεσιών Κοινωνικής Ευημερίας είναι:
        <ol>
        <li> η διασφάλιση ενός αξιοπρεπούς επιπέδου διαβίωσης για κάθε πολίτη, με ιδιαίτερη έμφαση
        στην προστασία των αδύνατων μελών της κοινωνίας,</li>
        <li> η διασφάλιση ψηλού επιπέδου υπηρεσιών ιδρυματικής και διημερεύουσας φροντίδας για
        παιδιά, ηλικιωμένους, άτομα με αναπηρίες και για άλλες κοινωνικά ευάλωτες ομάδες,</li>
        <li>η στήριξη της οικογένειας, η πρόληψη της οικογενειακής δυσλειτουργίας και η
        αντιμετώπιση προβλημάτων με στόχο την υγιή ένταξη κάθε ατόμου στην κοινωνία,</li>
        <li>η προστασία, ευημερία και διασφάλιση των συμφερόντων του παιδιού και η κηδεμονευτική
        επιτήρηση ανήλικων και ενήλικων παραβατών,</li>
        <li> η ενεργοποίηση και ενίσχυση των κοινοτήτων για αντιμετώπιση των αναγκών των κατοίκων
        τους σε τοπικό επίπεδο, με στόχο τη συλλογική δράση για γενικότερη κοινωνική ανάπτυξη.</li>
        </ol>
    </p>
  );
  
  const text3 = () => (
    <div >
      <p className='text-align-new'>
      Το Τμήμα Εργασίας είναι υπεύθυνο για θέματα:
        <ul>
            <li> απασχόλησης και αγοράς εργασίας</li>
            <li> καταπολέμησης των διακρίσεων και προώθηση της αρχής της ισότητας στο χώρο εργασίας</li>
        </ul>
        Μεταξύ άλλων, το Τμήμα είναι υπεύθυνο για παροχή υπηρεσιών εξεύρεσης εργασίας και πλήρωση θέσεων εργασίας, προστασίας ειδικών ομάδων στην απασχόληση και παρακολούθηση της λειτουργίας της αγοράς εργασίας και συντονισμό της Εθνικής Πολιτικής Απασχόλησης. Περισσότερες λεπτομέρειες φαίνονται στην Αποστολή και στις Δραστηριότητες του Τμήματος.
      </p>
    </div>
  );
  
  const text4 = () => (

      <p className='text-align-new'>
      Το Τμήμα Εργασιακών Σχέσεων είναι αρμόδιο για την προώθηση και εφαρμογή της κυβερνητικής πολιτικής στον τομέα των εργασιακών σχέσεων. Το Τμήμα είναι υπεύθυνο για την προώθηση και διατήρηση της εργατικής ειρήνης και υγιών εργατικών σχέσεων, με στόχο την αύξηση της κοινωνικής συνοχής, την παραγωγικότητα στην εργασία, την εμπέδωση της δημοκρατικής σκέψης και την εδραίωση της κοινωνικό-οικονομικής προόδου.
        Το Τμήμα είναι υπεύθυνο για:<br/>
        · την πρόληψη και επίλυση εργατικών διαφορών,<br/>
        · την διασφάλιση των συνδικαλιστικών ελευθεριών, συμπεριλαμβανομένου του δικαιώματος
        της οργάνωσης,<br/>
        · την προαγωγή των συλλογικών διαπραγματεύσεων, ως του βασικού μέσου για τον
        καθορισμό των όρων και συνθηκών εργασίας, και την ενθάρρυνση της δημιουργίας ισχυρών
        εργατικών και εργοδοτικών οργανώσεων με στόχο τη διασφάλιση ισορροπίας δυνάμεων,<br/>
        · την προστασία ευάλωτων τάξεων εργοδοτουμένων, με έμφαση στους συνδικαλιστικά
        ανοργάνωτους,<br/>
        · την προώθηση και εφαρμογή της σχετικής με τους όρους και συνθήκες απασχόλησης
        εργατικής νομοθεσίας, και<br/>
        · την εφαρμογή της περί Συντεχνιών Νομοθεσίας, περιλαμβανομένης της εγγραφής και του
        ελέγχου εργατικών και εργοδοτικών οργανώσεων.<br/>
      </p>

  );
  const text5 = () => (
    
      <p className='text-align-new'>
      Το Τμήμα Κοινωνικής Ενσωμάτωσης Ατόμων με Αναπηρίες, που ιδρύθηκε από την 1.1.2009, είναι αρμόδιο για τη διαμόρφωση, συντονισμό, υλοποίηση και παρακολούθηση των πολιτικών για τα άτομα με αναπηρίες, σε συνεργασία και διαβούλευση με τα συναρμόδια Υπουργεία και Υπηρεσίες, καθώς και τον κοινωνικό εταίρο, την Κυπριακή Συνομοσπονδία Οργανώσεων Αναπήρων.

    Όραμα του Τμήματος είναι η βελτίωση της ποιότητας ζωής των ατόμων με αναπηρίες και η δημιουργία νέων προοπτικών για την κοινωνική ενσωμάτωση τους, μέσω του σχεδιασμού, συντονισμού και υλοποίησης μεταρρυθμιστικών δράσεων.

    Οι κυριότερες αρμοδιότητες του Τμήματος είναι:
    <ul>
    · Η προώθηση και συντονισμός της αποτελεσματικής εφαρμογής της Σύμβασης του ΟΗΕ για τα Δικαιώματα των Ατόμων με Αναπηρίες που κυρώθηκε από την Κυπριακή Δημοκρατία το 2011.<br/>
    · Η διαμόρφωση και παρακολούθηση ενός Εθνικού Σχεδίου Δράσης για την Αναπηρία.<br/>
    · H διοικητική υποστήριξη του Παγκύπριου Συμβουλίου για τα Άτομα με Αναπηρίες, για την αποτελεσματική επιτέλεση του ρόλου του ως το ανώτατο συμβουλευτικό σώμα για την εθνική πολιτική για τα άτομα με αναπηρίες.<br/>
    · Η εγκαθίδρυση νέου Συστήματος Αξιολόγησης της Αναπηρίας και Λειτουργικότητας.<br/>
    · Η αναδιοργάνωση του τομέα της επαγγελματικής κατάρτισης και αποκατάστασης των ατόμων με αναπηρίες και η υιοθέτηση θετικών μέτρων και ρυθμίσεων για την ένταξη τους στην απασχόληση.<br/>
    · Η αποτελεσματικότερη διαχείριση και εκσυγχρονισμός των σχεδίων κοινωνικών παροχών προς τα άτομα με αναπηρίες.<br/>
    · Η καλλιέργεια αξιών και στάσεων και ενός περιβάλλοντος στην κοινωνία που να ενσωματώνει τα άτομα με αναπηρίες.<br/>
    </ul>

      </p>
  );
  
  export {text1, text2, text3, text4, text5};
  