import React from 'react';
import {Grid, Advertisement, Image, Header, Container, Segment} from 'semantic-ui-react';
import remoteworkillustration from '../../../images/remoteworkillustration.png'
import {BrowserRouter as Router, Switch, Route, Link} from 'react-router-dom';
import staysafegifbig from '../../../images/staysafegifbig.gif'
import './index.css';

export default function RemoteWork(){

    return(
        <Grid centered>
            <Grid.Row centered className='image-coloring'>
                <Image src={remoteworkillustration} size='big'/>
            </Grid.Row>
            <Grid.Row centered>
                <br></br>
            </Grid.Row>
            <Grid.Row >
                <Grid.Column width={8}>
                    <Segment>
                        <Header textAlign='center' as='h2'>Τηλεργασία: Οδηγίες για τις δηλώσεις.</Header>
                        <br></br>
                        <p className='text-align'>
                        Την 25η Σεπτεμβρίου 2020, οι εργοδότες υποχρεούνται να προαναγγείλουν το προσωπικό που απασχολούν υποχρεωτικά εξ' αποστάσεως, 
                        συμπληρώνοντας και υποβάλλοντας στο Πληροφοριακό Σύστημα «ΕΡΓΑΝΗ» το έντυπο 4.1 «Δήλωση εξ αποστάσεως εργασία-Έντυπο ειδικού σκοπού
                        του άρθρου 4 παρ. 2 της Πράξης Νομοθετικού Περιεχομένου (Α΄ 55/11.03.20). 
                        </p>
                        <p className='text-align'>
                        Tο ανωτέρω σύστημα εφαρμόζεται υποχρεωτικά από τις επιχειρήσεις της Περιφέρειας Αττικής μόνο στις περιπτώσεις όπου η εργασία μπορεί 
                        να παρασχεθεί από τους εργαζόμενους εξ αποστάσεως, (εξαιρουμένων των εκπαιδευτικών δομών του υπουργείου Παιδείας και Θρησκευμάτων, 
                        των δομών παροχής υπηρεσιών υγείας, των φαρμακαποθηκών, των επιχειρήσεων υπεραγορών τροφίμων και των ταχυμεταφορών), σε ποσοστό 40% επί
                        του συνολικού αριθμού των εργαζομένων που μπορούν να απασχοληθούν με το σύστημα αυτό.
                        </p>
                        <p className='text-align'>
                        Για το σκοπό της διάταξης, που είναι η αποσυμφόρηση των μέσων μαζικής μεταφοράς και των χώρων εργασίας, 
                        κατά τον υπολογισμό του ανωτέρω ποσοστού λαμβάνεται υπόψη ο αριθμός των πραγματικά απασχολουμένων στις εγκαταστάσεις της επιχείρησης, των οποίων
                        η εργασία μπορεί να παρασχεθεί εξ αποστάσεως, κατά το χρονικό διάστημα από τις 25/9/2020 έως τις 4/10/2020. Όπως αναφέρεται σε σχετική ανακοίνωση, κατά τον ανωτέρω υπολογισμό των εργαζομένων 
                        δεν λαμβάνονται υπόψη οι εργαζόμενοι των οποίων οι συμβάσεις τελούν σε αναστολή, καθώς και οι εργαζόμενοι που τελούν σε κάθε είδους νόμιμη άδεια, 
                        (όπως μητρότητας, ασθένειας, κ.ά.).
                        </p>
                        <p className='text-align'>
                        Επίσης, για τον ίδιο σκοπό, η διάταξη εφαρμόζεται και σε περιπτώσεις εργαζομένων που ο χρόνος εργασίας τους είναι μοιρασμένος σε εργασία γραφείου και σε 
                        εξωτερικές εργασίες και μόνο στο βαθμό που η εργασία γραφείου δύναται να παρασχεθεί εξ αποστάσεως. Σε περίπτωση κατά την οποία από τον υπολογισμό του ανωτέρω ποσοστού προκύπτει 
                        δεκαδικός αριθμός 0,50 και πάνω γίνεται στρογγυλοποίηση προς τα πάνω.
                        </p>
                        <p className='text-align'>
                        Ως προς τη συμπλήρωση του εντύπου Ε.4.1. παρέχονται οι ακόλουθες διευκρινίσεις:<br></br>
                            <ol>
                                <li>Ως ημερομηνία έναρξης της εξ αποστάσεως εργασίας αναγράφεται η 25η/9/2020, ενώ ως τόπος εργασίας ο τόπος εργασίας του εργαζομένου.</li>

                                <li>Στο πεδίο των παρατηρήσεων αναγράφεται ο συνολικός αριθμός των εργαζομένων της επιχείρησης που μπορούν να τεθούν σε εξ αποστάσεως εργασία.</li>

                                <li>Σε περίπτωση που εναλλάσσεται το εξ αποστάσεως προσωπικό της επιχείρησης, στη στήλη ΩΡΕΣ ΕΝΑΡΞΗΣ KAI ΛΗΞΗΣ, ΗΜΕΡΕΣ ΕΡΓΑΣΙΑΣ, αναγράφονται
                                οι ημέρες που ο εργαζόμενος παρέχει την εργασία του εξ αποστάσεως, εντός του οριζόμενου χρονικού διαστήματος. Στο ίδιο πλαίσιο, παρέχεται η δυνατότητα στους εργοδότες 
                                να τροποποιούν το έντυπο Ε.4.1., ανάλογα με τις εκάστοτε ανάγκες της επιχείρησης.</li>

                                <li>Στην περίπτωση επιχειρήσεων εντός της Περιφέρειας Αττικής που εφαρμόζουν ήδη το σύστημα της εξ αποστάσεως εργασίας με απόφαση του εργοδότη για το σύνολο ή για μέρος 
                                του προσωπικού τους, δυνάμει της περίπτωσης α) της παρ. 2 του άρθρου 4 της από 11.03.2020 ΠΝΠ, υφίσταται η ανωτέρω υποχρέωση προαναγγελίας του 40% του προσωπικού τους 
                                για το διάστημα από τις 25/9/2020 έως τις 4/10/2020 και όχι η υποβολή του εντύπου Ε.4.1. απολογιστικά.</li>

                                Από τις 5/10/2020, επανέρχεται η υποχρέωση υποβολής του εντύπου Ε.4.1. απολογιστικά, ήτοι εντός του πρώτου δεκαημέρου του επόμενου μήνα από την εφαρμογή του μέτρου.

                                <li>Εφόσον κατά τον υπολογισμό του ποσοστού του 40% του προσωπικού που δύναται να εργαστεί εξ αποστάσεως προκύπτει αριθμός 200 εργαζομένων και άνω, οι επιχειρήσεις 
                                δύνανται να υποβάλουν το έντυπο Ε.4.1., μέχρι και την 28η /9/2020, με ημερομηνία έναρξης του συστήματος εξ αποστάσεως εργασίας την 25η /9/2020. Η συγκεκριμένη ενέργεια δεν επισύρει 
                                τις κυρώσεις του νόμου.</li>
                            </ol>
                        </p>
                    </Segment>
                </Grid.Column>
                <Grid.Column width={2}>
                    <a href="https://covid19.gov.gr/category/oikonomia-ergasia/" target="_blank" rel="noopener noreferrer">
                        <Advertisement centered unit='half page'>
                            <Image src={staysafegifbig}/>
                        </Advertisement>
                    </a>
                </Grid.Column>
            </Grid.Row>
        </Grid>
    );
}