import React from "react"
import { Grid, Segment, Header, Container} from 'semantic-ui-react'
import Path from "../Path"
import './index.css'
const sections = [
    { key: 'Home', content: 'Home', link: true },
    { key: 'COVID-info', content: 'COVID-info', active: true }
]
  
export default function CovidInfo() {
    return (
        <div>
            <Path sections={sections} />
            <Header as='h2' textAlign="center">Πληροφορίες για τον COVID-19</Header>
            <Grid stackable rows={3} textAlign="center">
                <Grid.Row>
                    <Segment>
                        <Container>   
                        <Header as='h3'>Γενικές</Header>
                            <p className="style-covid-info">
                            Βασικές υποχρεώσεις εργοδοτών
                        1. Επικαιροποίηση της Εκτίμησης
                        Επαγγελματικού Κινδύνου ως προς την
                        αξιολόγηση του κινδύνου και τα μέτρα
                        πρόληψης και προστασίας έναντι του
                        κορωνοϊού.
                        2. Ενημέρωση των εργαζομένων για την
                        κίνδυνο λοίμωξης από τον κορωνοϊό και
                        τα μέτρα πρόληψης και προστασίας, βάσει
                        και των οδηγιών του ΕΟΔΥ.
                        3. Διαβούλευση με τους εργαζόμενους
                        και ενθάρρυνση για υποβολή σχετικών
                        προτάσεων.
                        4. Λήψη μέτρων περιβαλλοντικής και
                        ατομικής υγιεινής, όπως τακτικός
                        αερισμός των χώρων εργασίας,
                        συντήρηση των συστημάτων εξαερισμού -
                        κλιματισμού και καθαρισμός επιφανειών,
                        συσκευών κ.λπ., σύμφωνα και με τις
                        οδηγίες του ΕΟΔΥ.
                        5. Χορήγηση κατάλληλων μέσων ατομικής
                        προστασίας (Μ.Α.Π.) και επίβλεψη της
                        ορθής χρήσης τους.
                            </p>
                        </Container>
                    </Segment>
                </Grid.Row>
                <Grid.Row>
                    <Segment>
                        <Container>
                            <Header as='h3'>Για τον Εργοδότη</Header>
                            <p className="style-covid-info">
                            Βασικές υποχρεώσεις εργοδοτών
                        1. Επικαιροποίηση της Εκτίμησης
                        Επαγγελματικού Κινδύνου ως προς την
                        αξιολόγηση του κινδύνου και τα μέτρα
                        πρόληψης και προστασίας έναντι του
                        κορωνοϊού.
                        2. Ενημέρωση των εργαζομένων για την
                        κίνδυνο λοίμωξης από τον κορωνοϊό και
                        τα μέτρα πρόληψης και προστασίας, βάσει
                        και των οδηγιών του ΕΟΔΥ.
                        3. Διαβούλευση με τους εργαζόμενους
                        και ενθάρρυνση για υποβολή σχετικών
                        προτάσεων.
                        4. Λήψη μέτρων περιβαλλοντικής και
                        ατομικής υγιεινής, όπως τακτικός
                        αερισμός των χώρων εργασίας,
                        συντήρηση των συστημάτων εξαερισμού -
                        κλιματισμού και καθαρισμός επιφανειών,
                        συσκευών κ.λπ., σύμφωνα και με τις
                        οδηγίες του ΕΟΔΥ.
                        5. Χορήγηση κατάλληλων μέσων ατομικής
                        προστασίας (Μ.Α.Π.) και επίβλεψη της
                        ορθής χρήσης τους.
                        Βασικές υποχρεώσεις εργοδοτών
                        1. Επικαιροποίηση της Εκτίμησης
                        Επαγγελματικού Κινδύνου ως προς την
                        αξιολόγηση του κινδύνου και τα μέτρα
                        πρόληψης και προστασίας έναντι του
                        κορωνοϊού.
                        2. Ενημέρωση των εργαζομένων για την
                        κίνδυνο λοίμωξης από τον κορωνοϊό και
                        τα μέτρα πρόληψης και προστασίας, βάσει
                        και των οδηγιών του ΕΟΔΥ.
                        3. Διαβούλευση με τους εργαζόμενους
                        και ενθάρρυνση για υποβολή σχετικών
                        προτάσεων.
                        4. Λήψη μέτρων περιβαλλοντικής και
                        ατομικής υγιεινής, όπως τακτικός
                        αερισμός των χώρων εργασίας,
                        συντήρηση των συστημάτων εξαερισμού -
                        κλιματισμού και καθαρισμός επιφανειών,
                        συσκευών κ.λπ., σύμφωνα και με τις
                        οδηγίες του ΕΟΔΥ.
                        5. Χορήγηση κατάλληλων μέσων ατομικής
                        προστασίας (Μ.Α.Π.) και επίβλεψη της
                        ορθής χρήσης τους.
                            </p>
                        </Container>
                    </Segment>
                </Grid.Row>
                <Grid.Row>
                    <Segment>
                        <Container>
                            <Header as='h3'>Για τον Εργαζόμενο</Header>
                            <p className="style-covid-info">
                            Βασικές υποχρεώσεις εργοδοτών
                        1. Επικαιροποίηση της Εκτίμησης
                        Επαγγελματικού Κινδύνου ως προς την
                        αξιολόγηση του κινδύνου και τα μέτρα
                        πρόληψης και προστασίας έναντι του
                        κορωνοϊού.
                        2. Ενημέρωση των εργαζομένων για την
                        κίνδυνο λοίμωξης από τον κορωνοϊό και
                        τα μέτρα πρόληψης και προστασίας, βάσει
                        και των οδηγιών του ΕΟΔΥ.
                        3. Διαβούλευση με τους εργαζόμενους
                        και ενθάρρυνση για υποβολή σχετικών
                        προτάσεων.
                        4. Λήψη μέτρων περιβαλλοντικής και
                        ατομικής υγιεινής, όπως τακτικός
                        αερισμός των χώρων εργασίας,
                        συντήρηση των συστημάτων εξαερισμού -
                        κλιματισμού και καθαρισμός επιφανειών,
                        συσκευών κ.λπ., σύμφωνα και με τις
                        οδηγίες του ΕΟΔΥ.
                        5. Χορήγηση κατάλληλων μέσων ατομικής
                        προστασίας (Μ.Α.Π.) και επίβλεψη της
                        ορθής χρήσης τους.
                            </p>
                        </Container>
                    </Segment>
                </Grid.Row>
            </Grid>
        </div>
    )
}
