import React, {useState, useEffect} from 'react';
import {Button, Icon, Tab, Header, Grid, Image, Segment} from 'semantic-ui-react';
import './index.css';
import superagent from 'superagent';
import covidinfo from '../../images/covidinfo.jpg';
import deathcovidicon from '../../images/deathcovidicon.png';
import exitcovidicon from '../../images/exitcovidicon.png';
import newcaseicon from '../../images/newcaseicon.png';
import './index.css';

// This open proxy is used in order to add 'Access-Control-Allow-Origin' header = *
// to our request and get covidInfo when Using Firefox
// https://github.com/Rob--W/cors-anywhere/#documentation
const openProxy = '';

async function fetchCovidCases() {
  const res = await superagent.get(openProxy + 'https://covid-19-greece.herokuapp.com/confirmed');
  const cases_length = res.body.cases.length - 1;

  const today_max_case = res.body.cases[cases_length].confirmed;
  const before_today_max_case = res.body.cases[cases_length - 1].confirmed;

  const daily = today_max_case - before_today_max_case;
  const date = res.body.cases[cases_length].date;
  return [daily, today_max_case, date];
}

async function fetchCovidRecovered() {
  const res = await superagent.get(openProxy + 'https://covid-19-greece.herokuapp.com/recovered');
  const cases_length = res.body.cases.length - 1;

  const today_max_case = res.body.cases[cases_length].recovered;
  const before_today_max_case = res.body.cases[cases_length - 1].recovered;

  const daily = today_max_case - before_today_max_case;
  return [daily, today_max_case];
}

async function fetchCovidDeaths() {
  const res = await superagent.get(openProxy + 'https://covid-19-greece.herokuapp.com/deaths');
  const cases_length = res.body.cases.length - 1;

  const today_max_case = res.body.cases[cases_length].deaths;
  const before_today_max_case = res.body.cases[cases_length - 1].deaths;

  const daily = today_max_case - before_today_max_case;
  return [daily, today_max_case];
}

const panes = [
  {
    menuItem: 'Γενικές πληροφορίες',
    render: () => (
      <Tab.Pane attached={true}>
        <br />
        <p className="style-covid-info">
          <Header as="h4"> Γενικά </Header>
          Η τρέχουσα επιδημία COVID-19 προκαλείται από τον κορωνοϊό SARS-CoV-2, που ανήκει στην
          οικογένεια των κορωνοϊών, μία μεγάλη οικογένεια RNA ιών. Σύμφωνα με τον ΠΟΥ, ο όρος
          SARS-CoV-2 υποδεικνύει τον ιό, ενώ ο όρος COVID-19 (Cοrona Virus Disease-2019) υποδεικνύει
          τη νόσο που εκδηλώνεται από τον ιό SARS-CoV-2.
          <br />
          <Header as="h4"> Ποιος είναι ο τρόπος μετάδοσης του ιού; </Header>
          Παρόλο που ο ιός προέρχεται από τα ζώα, μεταδίδεται από άνθρωπο σε άνθρωπο. Η μετάδοση
          θεωρείται ότι γίνεται κυρίως μέσω του αναπνευστικού με σταγονίδια από το φτέρνισμα, τον
          βήχα ή την εκπνοή.
          <br />
          <Header as="h4">Ποια είναι τα συμπτώματα της COVID-19 λοίμωξης;</Header>
          Τα κύρια συμπτώματα της νόσου περιλαμβάνουν: πυρετό, βήχα, πονόλαιμο, αρθραλγίες,
          μυαλγίες, καταβολή και δυσκολία στην αναπνοή. Πότε ένα περιστατικό της νόσου θεωρείται
          περισσότερο μεταδοτικό; Ένα περιστατικό θεωρείται περισσότερο μεταδοτικό όταν εμφανίζει
          συμπτώματα, αλλά θα μπορούσε να είναι μεταδοτικό και στην ασυμπτωματική φάση. Δεν
          γνωρίζουμε το ποσοστό των ασυμπτωματικών περιστατικών, ούτε τον ακριβή ρόλο που παίζουν
          στη μετάδοση του SARS-CoV-2, πιθανολογείται όμως πως είναι μικρότερο από αυτό των
          συμπτωματικών περιπτώσεων της νόσου.
        </p>
      </Tab.Pane>
    ),
  },
  {
    menuItem: 'Εργασιακοί χώροι',
    render: () => (
      <Tab.Pane attached={true}>
        <p className="style-covid-info">
          <Header as="h4"> Μέτρα πρόληψης στους χώρους της επιχείρησης/εργασίας</Header>Η πανδημία
          Covid-19 είναι μια νεοεμφανιζόμενη ασθένεια με διαρκείς εξελίξεις όσο αφορά τα
          επιστημονικά δεδομένα. Ο Π.Ο.Υ. συστήνει τους εξής βασικούς κανόνες υγιεινής που πρέπει να
          τηρούνται για την πρόληψη του Covid-19.
          <ol>
            <li>Συχνό πλύσιμο των χεριών</li>
            <li>Ιχρήση προστατευτικών μέσων και</li>
            <li>Κοινωνική αποστασιοποίηση</li>
          </ol>
          Απαιτούνται ωστόσο ορισμένες κατευθυντήριες οδηγίες για τις επιχειρήσεις για την:
          <ol>
            <li>Αποτροπή της εισόδου κρουσμάτων στην επιχείρηση</li>
            <li>Αποτροπή της εξάπλωσης μέσα στην επιχείρηση</li>
            <li>Αποτροπή της εξάπλωσης στην ευρύτερη κοινότητα (και σε ευάλωτα άτομα)</li>
            <li>Μείωση των επιπτώσεων στην παραγωγή</li>
          </ol>
          Οι οδηγίες υπάγονται σε τέσσερις γενικούς τίτλους:
          <ol>
            <li>
              Μέτρα πρόληψης και ελέγχου της μόλυνσης σε διαρκή ισχύ για την πρόληψη της επιδημίας -
              στην είσοδο, της εγκατάστασης, στους χώρους εστίασης, στις περιοχές παραγωγής, στα
              αποδυτήρια τις τουαλέτες, κλπ.
            </li>
            <li>Εξωτερικούς παράγοντες στο εργασιακό περιβάλλον</li>
            <li>Μέτρα που πρέπει να ληφθούν σε υπόνοια ή επιβεβαίωση κρούσματος</li>
            <li>Πρόσθετα μέτρα που πρέπει να ληφθούν μετά την επιβεβαίωση κρούσματος</li>
          </ol>
          <Header as="h4"> 1. Μέτρα σε διαρκή ισχύ για την πρόληψη της επιδημίας</Header>
          Σταθμός ελέγχου όπου κάθε υπάλληλος – επισκέπτης που εισέρχεται ελέγχεται από κατάλληλα
          εκπαιδευμένο άτομο με:
          <ol>
            <li>Ερωτηματολόγιο διαλογής</li>
            <li>
              Εξοπλισμό ελέγχου της θερμοκρασίας. Κανείς δεν εισέρχεται στην εγκατάσταση εάν από το
              ερωτηματολόγιο διαπιστωθεί ότι έχει συμπτώματα της νόσου ή θερμοκρασία υψηλότερη από
              37,5C.
            </li>
          </ol>
          Ρυθμίσεις κοινωνικής αποστασιοποίησης: 2 μέτρα κατά την αναμονή με σήμανση του δαπέδου
          <ol>
            <li>Τήρηση κλιμακωτού ωραρίου</li>
            <li>Απαγόρευση περιττών επισκέψεων</li>
          </ol>
          <Header as="h4">
            {' '}
            2. Μέτρα που πρέπει να ληφθούν σε υπόνοια ή επιβεβαίωση κρούσματος{' '}
          </Header>
          <b>
            Βήματα που πρέπει να ληφθούν όταν υπάρχει υπόνοια ή επιβεβαίωση μεμονωμένης περίπτωσης
            COVID-19
          </b>
          <ol>
            <li>
              Οποιοσδήποτε υπάλληλος αποτύχει στο ερωτηματολόγιο διαλογής ή στον έλεγχο της
              θερμοκρασίας κατά την είσοδο στην εγκατάσταση πρέπει να απομακρυνθεί και να εξεταστεί
            </li>
            <li>
              Κάθε μέλος του προσωπικού που εμφανίζει συμπτώματα κατά τη διάρκεια της εργασίας θα
              πρέπει να απομονωθεί αμέσως, να σταλεί στο σπίτι και να επικοινωνήσει με τον Ε.Ο.Δ.Υ.
            </li>
            <li>Θα πρέπει να υπάρχει ένας χώρος απομόνωσης για τους συμπτωματικούς ασθενείς</li>
          </ol>
          <b>
            Πρωτόκολλο που ακολουθείται σε περίπτωση που ένας υπάλληλος ζει με άτομο που θεραπεύει
            ασθενείς Covid-19 ή έχει θετικό άτομο Covid-19 στο σπίτι του.
          </b>
          <ol>
            <li>
              Επιβεβαιώνεται ότι ο εργαζόμενος έχει ήδη εφαρμόσει διαδικασίες για την ελαχιστοποίηση
              του κινδύνου μετάδοσης στο σπίτι σύμφωνα με τις οδηγίες Ε.Ο.Δ.Υ.
            </li>
            <li>
              Έχει ενημερωθεί και παρακολουθεί συμπτώματα (βήχας, πυρετός άνω των 38 C, δύσπνοια)
              που παραπέμπουν στη νόσο.
            </li>
          </ol>
          <b>
            Βήματα που ακολουθούνται μετά την πληροφόρηση ότι ένας υπάλληλος / που ήλθε σε επαφή με
            τους υπόλοιπους υπαλλήλους ελέγχεται για στο Covid-19
          </b>
          <ol>
            <li>Ενημέρωση όλων των υπαλλήλων ότι αναμένονται τα αποτελέσματα των δοκιμών</li>
            <li>
              Ταυτοποίηση των υπαλλήλων που ήρθαν σε στενή επαφή με το άτομο κατά τις τελευταίες 72
              ώρες, διατηρώντας το απόρρητο του ατόμου.
            </li>
            <li>
              Εφόσον είναι δυνατό, απομάκρυνση όλων των υπαλλήλων που ήρθαν σε επαφή με το άτομο που
              ελέγχεται .μέχρι να είναι διαθέσιμα τα αποτελέσματα των εξετάσεων
            </li>
            <li>Επιμελή καθαριότητα και απολύμανση των «ύποπτων» επιφανειών.</li>
            <li>Προσαρμογές στην εργασία άλλων υπαλλήλων για την αντικατάσταση των απόντων</li>
          </ol>
        </p>
      </Tab.Pane>
    ),
  },
  {
    menuItem: 'Πληροφορίες εργοδοτών',
    render: () => (
      <Tab.Pane attached={true}>
        <p className="style-covid-info">
          <Header as="h4"> Ποιές είναι οι βασικές υποχρεώσεις εργοδοτών;</Header>
          <ol>
            <li>
              Επικαιροποίηση της Εκτίμησης Επαγγελματικού Κινδύνου ως προς την αξιολόγηση του
              κινδύνου και τα μέτρα πρόληψης και προστασίας έναντι του κορωνοϊού.
            </li>
            <li>
              Ενημέρωση των εργαζομένων για την κίνδυνο λοίμωξης από τον κορωνοϊό και τα μέτρα
              πρόληψης και προστασίας, βάσει και των οδηγιών του ΕΟΔΥ.
            </li>
            <li>Διαβούλευση με τους εργαζόμενους και ενθάρρυνση για υποβολή σχετικών προτάσεων.</li>
            <li>
              } Λήψη μέτρων περιβαλλοντικής και ατομικής υγιεινής, όπως τακτικός αερισμός των χώρων
              εργασίας, συντήρηση των συστημάτων εξαερισμού - κλιματισμού και καθαρισμός επιφανειών,
              συσκευών κ.λπ., σύμφωνα και με τις οδηγίες του ΕΟΔΥ.
            </li>
            <li>
              Χορήγηση κατάλληλων μέσων ατομικής προστασίας (Μ.Α.Π.) και επίβλεψη της ορθής χρήσης
              τους.
            </li>
          </ol>
          <b>
            Επισημαίνεται ότι η διάδοση του κορωνοϊού στην κοινότητα-εργασιακούς χώρους και ο
            περιορισμός των κρουσμάτων και της επιδημίας αποτελεί πρωτίστως θέμα Δημόσιας Υγείας.
            Συνεπώς η διαχείριση των προληπτικών μέτρων πρέπει, σε κάθε περίπτωση, να ακολουθεί τις
            συστάσεις που εκδίδει ο Εθνικός Οργανισμός Δημόσιας Υγείας (Ε.Ο.Δ.Υ.) και οι αρμόδιοι
            φορείς και Υπουργεία.
          </b>
          <br />
          <br />
          Ακολουθούν οδηγίες που μπορούν κατά περίπτωση να προσαρμοστούν στις ιδιαιτερότητες των
          επιχειρήσεων. Σε κάθε περίπτωση, οι οδηγίες ισχύουν ακόμη και για επιχειρήσεις που
          δραστηριοποιούνται σε γεωγραφικές περιοχές που δεν έχει επιβεβαιωθεί κρούσμα COVID-19. Τα
          προληπτικά μέτρα για τον έλεγχο της διασποράς της λοίμωξης COVID-19 περιλαμβάνουν
          οργανωτικά μέτρα, μέτρα ατομικής υγιεινής και μέσα ατομικής προστασίας, καθώς και
          περιβαλλοντικά μέτρα.
          <ol>
            <li>
              Οργανωτικά μέτρα πχ{' '}
              <b>
                Να αποφεύγονται οι κάθε μορφής εκδηλώσεις, να μετατεθούν μελλοντικά όλες οι
                προγραμματισμένες δραστηριότητες που συνεπάγονται συναθροίσεις ατόμων (σεμινάρια,
                ημερίδες, συμπόσια κ.λπ.).
              </b>
            </li>
            <li>
              Μέτρα ατομικής υγιεινής και μέσα ατομικής προστασίας πχ
              <b>
                αποφυγή των επαφών με άτομα που παρουσιάζουν συμπτώματα λοίμωξης αναπνευστικού,
                προτροπή και επίβλεψη της συμμόρφωσης των εργαζομένων και των τρίτων για την
                εφαρμογή ορθών πρακτικών ατομικής υγιεινής, αποφυγή κατανάλωσης κάθε είδους τροφής
                στους εργασιακούς χώρους, εκτός των χώρων εστίασης και παροχή των κατάλληλων
                ατομικών μέσων προστασίας μιας χρήσης
              </b>
            </li>
            <li>
              Περιβαλλοντικά μέτρα όπως πχ{' '}
              <b>
                {' '}
                τον επαρκή αερισμό των εργασιακών χώρων, τον συστηματικό καθαρισμό των χώρων και των
                επιφανειών εργασίας καθώς και των κοινόχρηστων χώρων, την απολύμανση μέσω ψεκασμού
                κ.λ.π
              </b>
            </li>
          </ol>
        </p>
      </Tab.Pane>
    ),
  },
  {
    menuItem: 'Πληροφορίες εργαζομένων',
    render: () => (
      <Tab.Pane attached={true}>
        <p className="style-covid-info">
          <Header as="h4"> Οδηγίες για τους εργαζόμενους</Header>
          <br />
          Κάθε εργαζόμενος έχει υποχρέωση να εφαρμόζει τους κανόνες υγείας και ασφάλειας και να
          φροντίζει ανάλογα με τις δυνατότητές του για την ασφάλεια και την υγεία του, καθώς και για
          την ασφάλεια και την υγεία των άλλων ατόμων που επηρεάζονται από τις πράξεις ή παραλείψεις
          του κατά την εργασία σύμφωνα με την εκπαίδευσή του και τις κατάλληλες οδηγίες του εργοδότη
          του. Για την πραγματοποίηση αυτών των στόχων, οι εργαζόμενοι οφείλουν ειδικότερα, σύμφωνα
          με την εκπαίδευση τους και τις κατάλληλες οδηγίες του εργοδότη τους, μεταξύ άλλων, να
          αναφέρουν αμέσως στον εργοδότη ή/και σε όσους ασκούν αρμοδιότητες τεχνικού ασφάλειας και
          ιατρού εργασίας, όλες τις καταστάσεις που μπορεί να θεωρηθεί εύλογα ότι παρουσιάζουν άμεσο
          και σοβαρό κίνδυνο για την ασφάλεια και την υγεία, καθώς και κάθε έλλειψη που
          διαπιστώνεται στα συστήματα προστασίας. Οι αρμόδιοι φορείς επισημαίνουν ότι τα προληπτικά
          μέτρα που παίρνουμε για τον περιορισμό της διάδοσης του κορωνοϊού, είναι μέτρα ατομικής
          και συλλογικής ευθύνης όλων μας. Πρέπει να καταλάβουμε ότι αγνοώντας τις συστάσεις των
          ειδικών, βάζουμε σε σοβαρό κίνδυνο την υγεία μας, καθώς και την υγεία των γύρω μας αλλά
          και των συνανθρώπων μας που ανήκουν σε ευπαθείς ομάδες. Οι εργαζόμενοι προασπίζοντας
          ενεργά όχι μόνο την υγεία τους, αλλά και την Δημόσια Υγεία, τηρούν και συγχρόνως διαδίδουν
          και μεταφέρουν στο ιδιωτικό και κοινωνικό τους περιβάλλον, τις οδηγίες και τους
          κανονισμούς σχετικά με την πρόληψη της λοίμωξης COVID-19. Οι εργαζόμενοι πρέπει να
          λαμβάνουν από τον εργοδότη την πληροφόρηση και ενημέρωση σχετικά με την επιδημία από τον
          κορωνοϊό, αλλά και τα μέτρα που προτίθεται η επιχείρηση να πάρει, καθώς και να απαιτούν
          την πλήρη εφαρμογή όλων των προληπτικών οδηγιών και μέτρων, για τον περιορισμό της
          επιδημίας, όπως αναλύθηκαν παραπάνω, καθώς και επιπλέον μέτρων που προτείνονται από τους
          αρμόδιους φορείς. Οι εργαζόμενοι συμμετέχοντας καθοριστικά στην πρόληψη για τον περιορισμό
          της επιδημίας, καλούνται στη σχολαστική τήρηση και εφαρμογή των οδηγιών των αρμόδιων
          φορέων (ΕΟΔΥ, ΓΓΠΠ κ.λπ.) όχι μόνο κατά τη διάρκεια του εργάσιμου χρόνου, αλλά στο σύνολο
          της ιδιωτικής και κοινωνικής τους ζωής.
          <Header as="h4">Γενικές οδηγίες ατομικής υγιεινής</Header>
          Α. Το πλύσιμο και η απολύμανση των χεριών είναι ιδιαιτέρως απαραίτητα:
          <ol>
            <li>
              πριν από την επαφή με τα μάτια, τη μύτη, το στόμα (φαγητό ή κάπνισμα, επίσκεψη στην
              τουαλέτα κ.λπ.)
            </li>
            <li>
              σε κάθε περίπτωση που τα χέρια μπορεί να ήλθαν σε επαφή με βιολογικά υγρά (σάλιο
              κ.λπ.), ακόμη κι αν χρησιμοποιήθηκαν γάντια.
            </li>
          </ol>
          Β. Όταν βήχουμε ή φταρνιζόμαστε, καλύπτουμε το στόμα μας με τον αγκώνα ή ένα χαρτομάντιλο
          και πλένουμε ή απολυμαίνουμε τα χέρια μας:
          <ol>
            <li>απορρίπτουμε το χαρτομάντιλο, αμέσως μετά τη χρήση, σε σκεπαστό κάδο</li>
            <li>
              αποφεύγουμε τις κοντινές επαφές ειδικά με άτομα που παρουσιάζουν συμπτώματα όπως
              πυρετό, βήχα, πονόλαιμο και καταρροή.
            </li>
          </ol>
          Γ. Οι εργαζόμενοι που παρουσιάζουν ένα ή περισσότερα από τα παρακάτω συμπτώματα νόσου όπως
          πυρετό, βήχα, πονόλαιμο, θα πρέπει να τηρήσουν τις οδηγίες του ΕΟΔΥ:
          <ol>
            <li>ενημερώνουμε τον εργοδότη ή την υπηρεσία μας</li>
            <li>επικοινωνούμε με το θεράποντα ιατρό μας</li>
            <li>επικοινωνούμε με τον ΕΟΔΥ (τηλέφωνα επικοινωνίας 210.52.12.054 ή 1135).</li>
          </ol>
        </p>
      </Tab.Pane>
    ),
  },
];

export default function CovidInfoTab() {
  const [numberOfNewCases, setNumberOfNewCases] = useState(0);
  const [numberOfTotalCases, setNumberOfTotalCases] = useState(0);
  const [numberOfNewDeaths, setNumberOfNewDeaths] = useState(0);
  const [numberOfTotalDeaths, setNumberOfTotalDeaths] = useState(0);
  const [numberOfNewRecovered, setNumberOfNewRecovered] = useState(0);
  const [numberOfTotalRecovered, setNumberOfTotalRecovered] = useState(0);
  const [date, setDate] = useState('2020-01-01');

  useEffect(() => {
    async function fetchCovid() {
      let response = await fetchCovidCases();
      setNumberOfNewCases(response[0]);
      setNumberOfTotalCases(response[1]);
      setDate(response[2]);
      response = await fetchCovidDeaths();
      setNumberOfNewDeaths(response[0]);
      setNumberOfTotalDeaths(response[1]);
      response = await fetchCovidRecovered();
      setNumberOfNewRecovered(response[0]);
      setNumberOfTotalRecovered(response[1]);
    }
    fetchCovid();
  }, []);

  return (
    <Grid>
      <Grid.Row centered className="image-coloring-covinfo">
        <Image src={covidinfo} size="medium" />
      </Grid.Row>
      <Grid.Row centered className="image-coloring-covinfo2">
        <Header style={{color: 'white'}} as="h3">
          Κορωνοϊός: Κατευθυντήριες οδηγίες.
        </Header>
      </Grid.Row>
      <Grid.Row>
        <Grid centered columns={3}>
          <Grid.Column width={3}>
            <Segment raised>
              <Grid>
                <Grid.Row>
                  <Grid.Column width={5}>
                    <Image src={newcaseicon} size="small" />
                  </Grid.Column>
                  <Grid.Column textAlign="center" width={10}>
                    <p>
                      <Header as="h3">+{numberOfNewCases} </Header>
                    </p>
                    <p>
                      <b>ΣΥΝΟΛΟ: &nbsp; {numberOfTotalCases}</b>
                    </p>
                    <p>ΚΡΟΥΣΜΑΤΑ</p>
                  </Grid.Column>
                </Grid.Row>
              </Grid>
            </Segment>
          </Grid.Column>
          <Grid.Column width={3}>
            <Segment raised>
              <Grid>
                <Grid.Row>
                  <Grid.Column width={5}>
                    <Image src={deathcovidicon} size="small" />
                  </Grid.Column>
                  <Grid.Column textAlign="center" width={10}>
                    <p>
                      <Header as="h3">+{numberOfNewDeaths} </Header>
                    </p>
                    <p>
                      <b>ΣΥΝΟΛΟ: &nbsp; {numberOfTotalDeaths}</b>
                    </p>
                    <p>ΑΠΩΛΕΙΕΣ</p>
                  </Grid.Column>
                </Grid.Row>
              </Grid>
            </Segment>
          </Grid.Column>
          <Grid.Column width={3}>
            <Segment raised>
              <Grid>
                <Grid.Row>
                  <Grid.Column width={5}>
                    <Image src={exitcovidicon} size="small" />
                  </Grid.Column>
                  <Grid.Column textAlign="center" width={11}>
                    <p>
                      <Header as="h3">+{numberOfNewRecovered} </Header>
                    </p>
                    <p>
                      <b>ΣΥΝΟΛΟ: &nbsp; {numberOfTotalRecovered}</b>
                    </p>
                    <p>ΕΞΗΛΘΑΝ ΑΠΟ ΜΕΘ</p>
                  </Grid.Column>
                </Grid.Row>
              </Grid>
            </Segment>
          </Grid.Column>
        </Grid>
      </Grid.Row>
      <Grid.Row centered>
        <Header as="h6">
          <Icon name="calendar alternate outline" />
          {date}
        </Header>
      </Grid.Row>
      <Grid.Row centered>
        <Grid.Column width={10}>
          <Tab panes={panes} />
        </Grid.Column>
      </Grid.Row>
    </Grid>
  );
}
