const text1 = () => (
  <p>
    Μέσω της υπηρεσίας παρέχεται η δυνατότητα στους οφειλέτες του ΚΕΑΟ να ρυθμίσουν ηλεκτρονικά τις
    οφειλές τους. Για την πρόσβαση στην ηλεκτρονική υπηρεσία:
    <ul>
      <li>
        Οι οφειλέτες - εργοδότες μπορούν να χρησιμοποιούν για την πρόσβασή τους, τους κωδικούς
        πρόσβασης που έχουν για την Ηλεκτρονική Υποβολή ΑΠΔ.
      </li>
      <li>
        Οι υπόλοιποι οφειλέτες πρέπει να κάνουν χρήση των κωδικών που δήλωσαν κατά την πιστοποίησή
        τους.
      </li>
    </ul>
    Όσοι οφειλέτες δεν έχουν αποκτήσει κωδικούς πρόσβασης για τις ηλεκτρονικές υπηρεσίες θα πρέπει,
    πριν την υποβολή αίτησης ρύθμισης, να πιστοποιηθούν μέσω της υπηρεσίας Πιστοποίηση οφειλετών.
  </p>
);

const text2 = () => (
  <p>
    Η διαδικασία <b>εγγραφής-πιστοποίησης</b> ολοκληρώνεται με τις ακόλουθες ενέργειες:
    <ol>
      <li>
        Για την εγγραφή σας στις <b>Ηλεκτρονικές Υπηρεσίες</b> προς Εργοδότες, θα πρέπει να δηλωθεί
        η <b>διεύθυνση Ηλεκτρονικού Ταχυδρομείου σας (e-mail)</b>, προκειμένου να σας αποσταλεί στη
        συγκεκριμένη διεύθυνση, μήνυμα από την υπηρεσία μας, με ένα{' '}
        <b>προσωρινό κωδικό πρόσβασης</b> καθώς και μια ηλεκτρονική διεύθυνση η οποία θα σας
        οδηγήσει στην επόμενη προς συμπλήρωση οθόνη.
      </li>
      <li>
        Η αποστολή της προηγούμενης οθόνης συμπληρωμένη με το <b>e-mail</b> σας και τον{' '}
        <b>προσωρινό κωδικό πρόσβασης</b> οδηγεί σε επόμενη οθόνη για την
        <b>εγγραφή στο σύστημα</b>.
      </li>
      <li>
        Σε άλλη χρονική στιγμή το ΙΚΑ-ΕΤΑΜ, θα φροντίσει να αποσταλούν με απαντητικά e-mails οι
        κωδικοί πρόσβασης (<b>Username, PIN και PUK</b>).
      </li>
    </ol>
  </p>
);

const text3 = () => (
  <div>
    <p>
      Η υποβολή των Α.Π.Δ. (Κανονικές ή Συμπληρωματικές (εμπρόθεσμες)) Κοινών Επιχειρήσεων και
      Οικοδομοτεχνικών Έργων πραγματοποιείται αποκλειστικά μέσω διαδικτύου, τον επόμενο ή μεθεπόμενο
      (Δημόσιο) μήνα από αυτόν της απασχόλησης, στις ημερομηνίες υποβολής που αναφέρονται στο
      σχετικό Γενικό Έγγραφο κάθε φορά σε μηνιαία βάση (για το έτος 2020 οδηγίες έχουν δοθεί με το
      υπ’ αριθμ. Δ.ΕΙΣΦ.Μ./777/1510530 - 17/12/2019 Γενικό Έγγραφο και για το έτος 2021 οδηγίες
      έχουν δοθεί με το υπ’ αριθμ. 338446/17.12.2020 Γενικό Έγγραφο).
    </p>
    <p>
      Κατ’ εξαίρεση, υπάρχει η δυνατότητα υποβολής Α.Π.Δ. με ψηφιακό – μαγνητικό μέσο ή σε έντυπη
      μορφή στο αρμόδιο Υποκατάστημα Μισθωτών ΕΦΚΑ από τους εργοδότες που:
      <ul>
        <li>Είναι Διαχειριστές κτιρίων (Πολυκατοικίες κλπ)</li>
        <li>
          Εκτελούν Δημόσια οικοδομοτεχνικά έργα με αυτεπιστασία ή με ανάθεση, οι οποίοι απασχολούν
          μέχρι και τρεις εργαζόμενους
        </li>
        <li>Εκτελούν Ιδιωτικά οικοδομικά και τεχνικά έργα με αυτεπιστασία</li>
      </ul>
    </p>
  </div>
);

const text4 = () => (
  <div>
    <p>
      Μέσω της Ηλεκτρονικής Υπηρεσίας Οικονομική καρτέλα εργοδότη, οι πιστοποιημένοι εργοδότες,
      έχουν την δυνατότητα να αντλήσουν οικονομικά στοιχεία που αφορούν στις κινήσεις (χρέωση -
      πίστωση) για το αιτούμενο χρονικό διάστημα.
    </p>
    <p>
      <ul aria-label="Οι οικονομικές κινήσεις αυτές αφορούν εισφορές που έχουν :">
        <li>δηλωθεί μέσω της Αναλυτικής Περιοδικής Δήλωσης (Α.Π.Δ.)</li>
        <li>καταβληθεί μέσω Πιστωτικών Ιδρυμάτων κ.λ.π.</li>
        <li>καταλογιστεί ως αποτέλεσμα του Ελέγχου Δηλωθέντων - Καταβληθέντων (Ε.Δ.Κ.)</li>
        <li>θεωρηθεί αχρεωστήτως καταβληθείσες ως αποτέλεσμα του Ε.Δ.Κ.</li>
      </ul>
    </p>
    <p>
      <b>Επισήμανση:</b> Η εικόνα χρέωσης από την ΑΠΔ ενεργείται μετά την επεξεργασία της από το ΟΠΣ
      - ΕΦΚΑ, ενώ για τις καταβληθείσες ασφαλιστικές εισφορές, μέσω Πιστωτικών Ιδρυμάτων κλπ,
      απαιτούνται <b>περίπου</b> τρεις (3) εργάσιμες ημέρες από την ημερομηνία καταβολής τους.
    </p>
    <p>
      Ο πιστοποιημένος εργοδότης εισάγει ως κριτήρια αναζήτησης το χρονικό διάστημα που τον αφορά
      και το σύστημα παρουσιάζει είτε σε μορφή εμφάνισης είτε σε μορφή αναφοράς (pdf) τις κινήσεις
      που έχουν ημερομηνία που περιλαμβάνεται στο αιτούμενο χρονικό διάστημα.
    </p>
    <p>
      Για την πρόσβαση στην Ηλεκτρονική Υπηρεσία Οικονομική καρτέλα εργοδότη, οι εργοδότες κάνουν
      χρήση των κωδικών πρόσβασης που χρησιμοποιούν για την Ηλεκτρονική Υποβολή ΑΠΔ.
    </p>
  </div>
);

export {text1, text2, text3, text4};
