import React from 'react';
import {Grid, Advertisement, Image, Header, Container, Segment} from 'semantic-ui-react';
import allowance from '../../../images/allowance.jpg'
import {BrowserRouter as Router, Switch, Route, Link} from 'react-router-dom';
import staysafegifbig from '../../../images/staysafegifbig.gif'
import etisi800 from '../../../images/etisi800.jpg'
import './index.css';

export default function AllowanceCovid(){

    return(
        <Grid centered>
            <Grid.Row centered className='image-coloring-allowance'>
                <Image src={allowance} size='large'/>
            </Grid.Row>
            <Grid.Row centered>
                <br></br>
            </Grid.Row>
            <Grid.Row >
                <Grid.Column width={8}>
                    <Segment>
                        <Header textAlign='center' as='h2'>Δήλωση εργαζομένων για την αντιμετώπιση του Covid-19.</Header>
                        <br></br>
                        <p className='text-align'>
                        Άνοιξε πλέον η πλατφόρμα <b>supportemployees.yeka.gr</b> στην οποία από σήμερα υποβάλλουν τις αιτήσεις τους 
                        οι εργαζόμενοι των οποίων ανεστάλη η σύμβαση εργασίας τους και είναι δικαιούχοι για το επίδομα 800 ευρώ.
                        </p>
                        <p className='text-align'>
                        Οι δηλώσεις θα γίνονται στην πλατφόρμα supportemployees.yeka.gr.
                        Προσοχή οι αιτήσεις υποβάλλονται από σήμερα 1.4.2020 για όσους ο ΑΦΜ τους τελειώνει σε 1.
                        Οι εργαζόμενοι καλούνται να συμπληρώσουν τα ειδικά ηλεκτρονικά έντυπα τόσο για τη μείωση κατά 
                        40% του μισθώματος της πρώτης κατοικίας τους (για εργαζόμενους επιχειρήσεων που έκλεισαν με κρατική εντολή), 
                        όσο και για να λάβουν την αποζημίωση του ειδικού σκοπού, ύψους 800 ευρώ.
                        Η υποβολή της υπεύθυνης δήλωσης για όσους έχουν αναστολή της σύμβασης εργασίας τους με εντολή δημόσιας Αρχής
                        πραγματοποιείται εντός του χρονικού διαστήματος από 1/4/2020 μέχρι και 10/4/2020, ως εξής:
                        </p>
                            <ul className='text-align'>
                                την 1η Απριλίου 2020 οι εργαζόμενοι με ΑΦΜ που λήγει σε 1 <br />
                                στις 2 Απριλίου οι εργαζόμενοι με ΑΦΜ που λήγει σε 2 <br />
                                στις 3 Απριλίου οι εργαζόμενοι με ΑΦΜ που λήγει σε 3 <br />
                                στις 4 Απριλίου οι εργαζόμενοι με ΑΦΜ που λήγει σε 4 <br />
                                στις 5 Απριλίου οι εργαζόμενοι με ΑΦΜ που λήγει σε 5 <br />
                                στις 6 Απριλίου οι εργαζόμενοι με ΑΦΜ που λήγει σε 6 <br />
                                στις 7 Απριλίου οι εργαζόμενοι με ΑΦΜ που λήγει σε 7 <br />
                                στις 8 Απριλίου οι εργαζόμενοι με ΑΦΜ που λήγει σε 8 <br />
                                στις 9 Απριλίου οι εργαζόμενοι με ΑΦΜ που λήγει σε 9 <br />
                                στις 10 Απριλίου οι εργαζόμενοι με ΑΦΜ που λήγει σε 0 <br />
                            </ul>
                        <p className='text-align'>
                        Παράλληλα οι εργαζόμενοι που έχουν αναστολή της σύμβασης εργασίας τους με βάση τους ΚΑΔ του υπουργείου 
                        Οικονομικών υποβάλλουν υποχρεωτικά υπεύθυνη δήλωση με τίτλο «Υπεύθυνη Δήλωση Εργαζομένων με εξαρτημένη εργασία σε 
                        Επιχειρήσεις – Εργοδότες» για τη χορήγηση έκτακτης οικονομικής ενίσχυσης, ως αποζημίωση ειδικού σκοπού, στην ηλεκτρονική
                        πλατφόρμα του ειδικού μηχανισμού στήριξης των εργαζομένων (supportemployees.yeka.gr).
                        </p>
                        <p className='text-align'>
                        Η υποβολή της υπεύθυνης δήλωσης μπορεί να γίνει από την 1/4/2020 μέχρι και τις 30/4/2020 και σε κάθε περίπτωση μετά τη γνωστοποίηση 
                        σε αυτόν της αναστολής της σύμβασης εργασίας του. Ανοιχτό είναι το ενδεχόμενο να δοθεί παράταση για τις αιτήσεις στο supportemployees.ypeka.gr, 
                        των εργαζομένων στις επιχειρήσεις που έχει ανασταλεί υποχρεωτικά η λειτουργία τους με εντολή δημόσιας αρχής καθώς έχει δοθεί παράταση στην υποβολή 
                        αιτήσεων των επιχειρήσεων μέχρι τις 10 Απριλίου.
                        Την επόμενη εβδομάδα θα ξεκινήσει η πληρωμή της αποζημίωσης ειδικού σκοπού ύψους 800 ευρώ στους πρώτους εργαζόμενους. 
                        Οι πληρωμές θα γίνονται σταδιακά ανάλογα με το πότε υποβλήθηκε η υπεύθυνη δήλωση.
                        </p>
                        <Header as='h3'>Πως γίνεται η αίτηση</Header>
                        <Image  src={etisi800}/>
                        <p className='text-align'>
                        Οι εργαζόμενοι των επιχειρήσεων που η λειτουργία τους έχει ανασταλεί με απόφαση του κράτους ή πλήττονται σημαντικά μπορούν να μπουν στην φόρμα 
                        και να υποβάλουν την Υπεύθυνη Δήλωση Εργαζομένου.
                        Για να κάνουν την αίτηση οι εργαζόμενοι θα πρέπει να έχουν τον αριθμό πρωτοκόλλου της αίτησης που έχει κάνει ο εργοδότης τους.
                        Εκεί θα ζητηθούν τα στοιχεία του προσωπικού σας τραπεζικού λογαριασμού IBAN, καθώς και τον αριθμό πρωτοκόλλου καταχώρισης της υπεύθυνης
                        δήλωσης της εκάστοτε εταιρείας.Εκεί δηλώνουν και το αν μισθώνουν κύρια κατοικία, καθώς και τα στοιχεία του εκμισθωτή και του μίσθιου ακινήτου, 
                        προκειμένου να τύχουν της έκπτωσης του 40%.Για τους εργαζόμενους των επιχειρήσεων που πλήττονται βάσει ΚΑΔ κύριας δραστηριότητας ή δευτερεύουσας, 
                        όπως ορίζονται από το Υπουργείο Οικονομικών, κάνουν αίτηση στην πλατφόρμα μέχρι και τις 30 Απριλίου.Παράλληλα, αίτηση πρέπει να υποβάλλουν 
                        και οι εργαζόμενοι των επιχειρήσεων που ανεστάλη η επιχειρηματική τους δραστηριότητα με εντολή δημόσιας αρχής και των οποίων οι συμβάσεις εργασίας 
                        τους έχουν λυθεί, είτε με οικειοθελή αποχώρηση, είτε με καταγγελία εντός του χρονικού διαστήματος από 1/3/2020 έως και 20/3/2020 οι οποίοι δικαιούνται
                        αποζημίωση ειδικού σκοπού ύψους 800 ευρώ εφόσον δεν έχουν άλλη σύμβαση εξαρτημένης εργασίας σε άλλον εργοδότη.
                        </p>
                    </Segment>
                </Grid.Column>
                <Grid.Column width={2}>
                    <a href="https://covid19.gov.gr/category/oikonomia-ergasia/" target="_blank" rel="noopener noreferrer">
                        <Advertisement centered unit='half page'>
                            <Image src={staysafegifbig}/>
                        </Advertisement>
                    </a>
                </Grid.Column>
            </Grid.Row>
        </Grid>
    );
}