import React from 'react';
import {Accordion, Segment, Grid, Header} from 'semantic-ui-react';
import './index.css';

const Level1Content = <div>Όχι. Ο καθένας μπορεί να ενημερωθεί για θέματα σχετικά με την εργασία χωρίς λογαριασμό. Η χρήση προσωποποιημένου λογαριασμόυ είναι σημαντική μόνο για συγκεκριμένες
  λειτουργείες όπως π.χ. η κράτηση ραντεβού με το Υπουργείο.
</div>;
const Level2Content = <div>Προσωρινά αυτή η λειτουργία δεν ειναι διαθέσιμη. Δουλεύουμε ακόμα πάνω σε αυτό. Πολύ σύντομα θα είναι </div>;
const Level3Content = <div>Εεεε, Μάνο;</div>;
const Level4Content = (<div>
    Οι επιχειρήσεις υπεραγορών (super market) για όσο διάστημα ισχύουν τα περιοριστικά μέτρα και έως
    ότου δοθούν διαφορετικές οδηγίες , είναι υποχρεωμένες να διασφαλίζουν:
    <ol>
      <li>
        Τήρηση της αναλογίας ενός ατόμου/ανά 15 τ.μ. και με ελάχιστη απόσταση μεταξύ τους τα δύο (2)
        μέτρα σε όλους τους χώρους των super market. Η συγκεκριμένη αναλογία των 15 τ.μ. και της
        ελάχιστης απόστασης δύναται να επανακαθοριστεί αναλόγως της εξέλιξης της διασποράς.
      </li>
      <li>
        Την κατάλληλη επί του δαπέδου σήμανση απόστασης δύο (2) μέτρων μεταξύ δύο (2) πελατών στο
        χώρο αναμονής μπροστά των ταμείων των σούπερ μάρκετ
      </li>
      <li>Αποφυγή φαινομένων συνωστισμού και συμφόρησης στους χώρους στάθμευσης.</li>
      <li>
        Ύπαρξη συσκευών απολύμανσης στις εισόδους των καταστημάτων προς δωρεάν χρήση από τους
        καταναλωτές.
      </li>
      <li>
        Χρήση τεχνητών / ή και φυσικών μέσων για τον τακτικό αερισμό των χώρων καθώς και απολύμανσης
        αυτών.
      </li>
      <li>
        Τήρηση των διαδικασιών για προληπτικούς/κατασταλτικούς λόγους που σχετίζονται με τον
        κορονοϊό COVID -19.
      </li>
      <li>
        Δυνατότητα λειτουργίας και τις Κυριακές με σκοπό την κατ οίκον παράδοση αγαθών στους
        καταναλωτές για παραγγελίες που έχουν καταγραφεί μέσω του ηλεκτρονικού τους συστήματος.
      </li>
    </ol>
  </div>);
const Level5Content =<div>
  Η άδεια ειδικού σκοπού αποτελεί δικαίωμα κάθε εργαζόμενου και ισχύει τόσο για τον ιδιωτικό όσο και για τον δημόσιο τομέα. Δικαιούχοι της
  άδειας ειδικού σκοπού είναι οι φυσικοί, θετοί ή ανάδοχοι γονείς εφόσον τα παιδιά τους:
<ol>
α) είναι εγγεγραμμένα σε βρεφικούς, βρεφονηπιακούς και παιδικούς σταθμούς,<br/>

β) φοιτούν σε σχολικές μονάδες υποχρεωτικής εκπαίδευσης (Νηπιαγωγείο, Δημοτικό και Γυμνάσιο),<br/>

γ) φοιτούν σε ειδικά σχολεία ή σχολικές μονάδες ειδικής αγωγής και εκπαίδευσης, ανεξαρτήτως ορίου ηλικίας των παιδιών,<br/>

δ) είναι άτομα με αναπηρία και είναι ωφελούμενα σε δομές παροχής υπηρεσιών ανοικτής φροντίδας για άτομα με αναπηρία, ανεξαρτήτως της ηλικίας τους.<br/>
</ol>
</div>;
const Level6Content =<div>Μπορείτε να αποταθείτε για επίδομα ανεργίας για την περίοδο που είσαστε άνεργος, ικανός και διαθέσιμος για εργασία.
            Πρέπει πρώτα να παρουσιαστείτε στο Επαρχιακό Γραφείο Εργασίας και να εγγραφείτε στις Υπηρεσίες Απασχόλησης για σκοπούς εξεύρεσης εργασίας. 
            Αν το Επαρχιακό Γραφείο Εργασίας δε σας τοποθετήσει σε εργασία, τότε πρέπει να παρουσιαστείτε στο Επαρχιακό Γραφείο Κοινωνικών Ασφαλίσεων για να εγγραφείτε στο μητρώο ανέργων.
            Θα πρέπει να παρουσιάζεστε κατά τακτά χρονικά διαστήματα για υπογραφή στο μητρώο ανέργων κατά τις μέρες που ορίζει το Επαρχιακό Γραφείο Κοινωνικών Ασφαλίσεων. 
            Για να πληρωθείτε επίδομα ανεργίας πρέπει επίσης να ικανοποιείτε τις καθορισμένες από τη νομοθεσία ασφαλιστικές προϋποθέσεις.
            </div>;


const rootPanels = [
  {
    key: 'panel-1',
    title: 'Χρειάζομαι προσωπικό λογαριασμό για να χρησιμοποιήσω τον ιστότοπο;',
    content: {content: Level1Content},
  },
  {
    key: 'panel-2',
    title: 'Ξέχασα τον κωδικό μου. Πως τον επανακτώ;',
    content: {content: Level2Content},
  },
  {key: 'panel-3', title: 'Θα περάσουμε το μάθημα;', content: {content: Level3Content}},
  {
    key: 'panel-4',
    title:
      'Ποια είναι τα προληπτικά μέτρα που πρέπει να εφαρμόζουν οι επιχειρήσεις υπεραγορών (super market) για τον περιορισμό της διασποράς του κορονοϊού;',
    content: {content: Level4Content},
  },
  {key: 'panel-5', title: 'Τι είναι η «Άδεια Ειδικού Σκοπού» και ποιοι είναι δικαιούχοι;', content: {content: Level5Content}},
  {key: 'panel-6', title: 'Είμαι άνεργος. Τι πρέπει να κάνω για να πληρωθώ επίδομα ανεργίας;', content: {content: Level6Content}},
];

export default function Faq() {
  return (
    <Segment style={{padding: '6em 4em'}} vertical>
      <Grid centered className="align-text">
        <Header as="h1">
          <div className="title-color">Συχνές ερωτήσεις</div>
        </Header>
        <br></br>
      </Grid>
      <Grid centered className="align-text">
        <Accordion
          className="question-move"
          fluid
          defaultActiveIndex={0}
          panels={rootPanels}
          styled
        />
      </Grid>
    </Segment>
  );
}
